@echo off

echo: Початок сценарію. 

mkdir "Лабораторні\Група\Левченко Максим Андрійович\Командна стрічка\Прихована папка"
mkdir "Лабораторні\Група\Левченко Максим Андрійович\Командна стрічка\Не прихована папка"

echo: Створили каталог.

tree /a /f

echo: Вивели каталог. 

attrib +h "Лабораторні\Група\Левченко Максим Андрійович\Командна стрічка\Прихована папка"

echo: Приховали папку.

xcopy /? > "Лабораторні\Група\Левченко Максим Андрійович\Командна стрічка\Не прихована папка/copyhelp.txt"

echo: Записали результат виконання команди до файлу copyhelp.txt.

echo f | xcopy "Лабораторні\Група\Левченко Максим Андрійович\Командна стрічка\Не прихована папка"\copyhelp.txt /y "Лабораторні\Група\Левченко Максим Андрійович\Командна стрічка\Прихована папка"\copied_copyhelp.txt

echo: Скопіювали файл copyhelp.txt з перейменуванням на copied_copyhelp.txt.

mkdir "Лабораторні\Група\Левченко Максим Андрійович\batch\Прихована папка"
mkdir "Лабораторні\Група\Левченко Максим Андрійович\batch\Не прихована папка"

echo: Створили вітку batch у папці Левченко Максим Андрійович. 

tree /a /f

echo: Вивели каталог. 

attrib +h "Лабораторні\Група\Левченко Максим Андрійович\batch\Прихована папка"

echo: Приховали папку. 

xcopy /? > "Лабораторні\Група\Левченко Максим Андрійович\batch\Не прихована папка/copyhelp.txt"

echo: Записали результат виконання команди до файлу copyhelp.txt.

echo f | xcopy "Лабораторні\Група\Левченко Максим Андрійович\batch\Не прихована папка"\copyhelp.txt /y "Лабораторні\Група\Левченко Максим Андрійович\batch\Прихована папка"\copied_copyhelp.txt

echo: Скопіювали файл copyhelp.txt з перейменуванням на copied_copyhelp.txt.

echo: Відкривається окремий batch файл, для перегляду звіту.

separate_batch_file.bat

echo: Частина 2.

echo: Створили папку Documents, звідки будемо брати потрібні формати файлів.

echo: Туди вже раніше помістили файли.

movefiles.bat "D:\Games" txt jpg

echo Переміщення завершено успішно.

echo: Показ лабораторної роботи завершено. 

pause
